Examinator/src/Enums/ВариантыЗагрузкиКартинокФайловСУЗ/ВариантыЗагрузкиКартинокФайловСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыЗагрузкиКартинокФайловСУЗ</name>
  <enumValues>
    <name>Стандартные</name>
  </enumValues>
  <enumValues>
    <name>Исходные</name>
  </enumValues>
  <enumValues>
    <name>УвеличиватьСтандартные</name>
  </enumValues>
  <enumValues>
    <name>УвеличиватьИсходные</name>
  </enumValues>
  <enumValues>
    <name>РасширятьСтандартные</name>
  </enumValues>
  <enumValues>
    <name>РасширятьИсходные</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ВариантыЗагрузкиКартинокФайловСУЗ/ManagerModule.bsl
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Свойство("УпрощенныйРежим") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ДанныеВыбора = Новый СписокЗначений;

		Элемент = ДанныеВыбора.Добавить();
		Элемент.Значение = Перечисления.ВариантыЗагрузкиКартинокФайловСУЗ.Стандартные;
		Элемент.Представление = "Стандартные";
		
		Элемент = ДанныеВыбора.Добавить();
		Элемент.Значение = Перечисления.ВариантыЗагрузкиКартинокФайловСУЗ.Исходные;
		Элемент.Представление = "Исходные";
		
		Элемент = ДанныеВыбора.Добавить();
		Элемент.Значение = Перечисления.ВариантыЗагрузкиКартинокФайловСУЗ.УвеличиватьСтандартные;
		Элемент.Представление = "Увеличивать стандартные";
		
		Элемент = ДанныеВыбора.Добавить();
		Элемент.Значение = Перечисления.ВариантыЗагрузкиКартинокФайловСУЗ.РасширятьСтандартные;
		Элемент.Представление = "Расширять стандартные";
		
	КонецЕсли;
	
КонецПроцедуры
